000100160324PGM
000101160324CALL       STRJOB
000102160324             ADDLIBLE  IBC233LIB
000103160324             MONMSG     MSGID(CPF2103) EXEC(SNDPGMMSG MSG('CONTACT SYSTEM ADMINISTRATOR OVER    +
000104160324                         LIBRARY LIST ERROR'))
000105160324
000106160208             DSPSYSLVL *DISPLAY
