000100160324PGM
000101160324CALL       STRJOB
000102160324             ADDLIBLE  IBC233LIB
000103160406             ADDLIBLE  SENECAPAY
000104160324             MONMSG     MSGID(CPF2103) EXEC(SNDPGMMSG MSG('CONTACT SYSTEM ADMINISTRATOR OVER    +
000105160324                         LIBRARY LIST ERROR'))
000106160324             DSPCMD DSPSYSLVL
000109160324ENDPGM
