000100160115
000200160115/********************************************************************/
000300160115/*SYSVALPRG- display systems value                                  */
000400160115/********************************************************************/
000500160115
000600160115
000700160115PGM
000800160115       DSPLIBL
000900160115       DSPSYSVAL QSYSLIBL
001000160115       DSPSYSVAL QUSRLIBL
001100160115       DSPSYSVAL QMODEL
001200160115
001300160115ENDPGM
