000100160311     A          R STUDENTR                  PFILE(STUDENTS2)                                        
000101160303     A          K LASTNAME                                                                          
000102160303     A          S FEESOWED                  COMP(GT 0)                                              
000103160303                                                                                                    
000104160303                                                                                                    
000105160303                                                                                                    
