000100160411     A          R ALLSHIFT                    PFILE(SENECAPAY/ALLSHIFT)                             
000101160411     A          K EMPNUM                                                                            
000102160411     A          S WORKSHIFT                   COMP(EQ 'A')                                          
