000100160307     A                                      DSPSIZ(24 80 *DS3)
000200091027     A          R RECORD1
000300091027     A                                  4  2'Student Number:'
000400091027     A                                  2 28'Student Information'
000500091027     A                                  8  2'Birth Date:'
000600091027     A                                  4 39'Phone:'
000700091027     A                                 10  2'Address:'
000800091027     A                                 20 32'F3 - Exit'
000900091027     A                                  2 70DATE
001000091027     A                                      EDTCDE(Y)
001100091027     A                                  2  2USER
001200091027     A                                  6  2'Name:'
001203160305     A            BIRTHDATE R        B  8 15REFFLD(STUDENTR/BIRTHDATE +
001204160305     A                                      DW233F02/STUDENTS2)
001205160305     A            ADDRESS1  R        O 10 13REFFLD(STUDENTR/ADDRESS1 +
001206160305     A                                      DW233F02/STUDENTS2)
001207160305     A            STUDNO    R        O  4 20REFFLD(STUDENTR/STUDNO DW233F02/STU-
001208160305     A                                      DENTS2)
001209160305     A            PHONE     R        B  4 47REFFLD(STUDENTR/PHONE DW233F02/STUD-
001210160305     A                                      ENTS2)
001211160305     A            FULLNAME      31   O  6 12
001300091027     A          R RECORD2
001400091027     A                                  5 16'Total Students: '
001500091027     A                                  7 20'Fines Owed: '
001600091027     A                                  8 21'Fees Owed: '
001700091027     A            TOTALSTUD      5Y 0O  5 33EDTCDE(1)
001800160305     A            TOTALFEES      7Y 2O  8 33EDTCDE(1)
001801160305     A  30                                  DSPATR(RI)
001900160305     A            TOTALFINES     7Y 2O  7 33
001901160305     A  20                                  DSPATR(RI)
001902160305     A                                      EDTCDE(1)
002000160305     A            TOTALOWING     8N 0O 10 32
002100091027     A                                 10 19'Total Owing:'
002200091027     A                                  2 27'Student Summary'
002300091027     A                                  2 70DATE
002400091027     A                                      EDTCDE(Y)
002500091027     A                                  3 70TIME
002600091027     A                                  2  2USER
